docs: Replace plantuml with mermaid
